app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM `categories`
---
  def new
    @article = Article.new
    @category = Category.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`updated_at`, `title`, `category_id`, `article_content`, `created_at`) VALUES('2009-10-23 02:50:08', '测试文章2', 1, '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;测试文章2</p>', '2009-10-23 02:50:08')
---
  def create
    @article = Article.new(params[:article])
    @article.get_category_id(params[:category_id])
    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 4)
DELETE FROM `articles` WHERE `id` = 4
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy