app/controllers/blog_controller.rb

  def index
  	@categories = Category.all
    #@tags = Article.tag_counts
    @articles = Article.paginate(:per_page =>10,:page =>params[:page],:order => "created_at DESC")
---
SELECT * FROM `categories`
SELECT * FROM `articles` LIMIT 0, 5
SELECT count(*) AS count_all FROM `articles`