app/controllers/categories_controller.rb

	def show
		# find out all articles belong to a category
		@articles = Article.find(:all, :conditions => ["category_id = ?",params[:id]], :order => "created_at DESC")
---
SELECT * FROM `articles` WHERE (category_id = '1') ORDER BY created_at DESC