app/controllers/comments_controller.rb

	def create
	  respond_to do |format|
	  #先判断是否为空
	  #if !(params[:title]).blank? && !(params[:comment]).blank?
	    @comment = Comment.new(params[:comment])
		  @article = Article.find(params[:article_id])
		if !(@comment.title).blank? && !(@comment.comment).blank?
		  @article.comments<<@comment
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 0)
INSERT INTO `comments` (`commentable_type`, `updated_at`, `title`, `commentable_id`, `user_id`, `comment`, `created_at`) VALUES('Article', '2009-11-06 14:29:50', 'woshizsb', 1, NULL, '好', '2009-11-06 14:29:50')