app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '7a296f74622603869a8846a395b786ac9ceb60f2', '2009-11-07 07:47:09', '16a04607d757fa976d3efba21369b5df8df2f886', NULL, NULL, 'zshuaibin', 'zshuaibin@gmail.com', '2009-11-07 07:47:09')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save